PlayaJay22/code-samples/ARM Cortex Programming/stm32f407_drivers/Src/017rtc_led.c
/*
 * 017rtc_led.c
 *
 *  Created on: Nov 26, 2022
 *      Author: Jason
 */
#include <stdio.h>
#include "stm32f407xx.h"
#include "ds1307.h"
#include "lcd.h"

char* get_day_of_week(uint8_t i);
void number_to_string(uint8_t num , char* buf);
char* time_to_string(RTC_time_t *rtc_time);
char* date_to_string(RTC_date_t *rtc_date);
void init_systick_timer(uint32_t tick_hz);
static void mdelay(uint32_t cnt);


#define SYSTICK_TIM_CLK   16000000UL

/* Enable this macro if you want to test RTC on LCD */
#define PRINT_LCD



int main(void)
{
	RTC_time_t current_time;
	RTC_date_t current_date;

	printf("RTC test\n");

	lcd_init();

	lcd_print_string("RTC test...");

	mdelay(2000);
	lcd_display_clear();
	lcd_display_return_home();

	if(ds1307_init())
	{
		printf("RTC init failed\n");
		while(1);
	}
	init_systick_timer(1);

	current_date.date = 10;
	current_date.day = SATURDAY;
	current_date.month = 12;
	current_date.year = 22;

	current_time.hours = 7;
	current_time.minutes = 20;
	current_time.seconds = 00;
	current_time.time_format = TIME_FORMAT_12HRS_PM;

	ds1307_set_current_date(&current_date);
	ds1307_set_current_time(&current_time);

	//now go read the values and display
	ds1307_set_current_date(&current_date);
	ds1307_set_current_time(&current_time);

	//display current time
	char *am_pm;
	if(current_time.time_format != TIME_FORMAT_24HRS)
	{
		am_pm = current_time.time_format ? "PM" : "AM";
		printf("current time is %s %s\n",time_to_string(&current_time), am_pm);
	} else
	{
		printf("current time is %s \n",time_to_string(&current_time));
	}

	//display current date 15/01/21 <friday>
	printf("current date = %s <%s>\n", date_to_string(&current_date), get_day_of_week(current_date.day));

	while(1);

	return 0;
}

char* get_day_of_week(uint8_t i)
{
	char* days[] = { "Sun","Mon","Tues","Wed","Thurs","Fri","Sat"};

	return days[i-1];
}


//convert digits to ascii values
void number_to_string(uint8_t num , char* buf)
{

	if(num < 10){
		buf[0] = '0';
		buf[1] = num+48;
	}else if(num >= 10 && num < 99)
	{
		buf[0] = (num/10) + 48;
		buf[1]= (num % 10) + 48;
	}
}



//hh:mm:ss
char* time_to_string(RTC_time_t *rtc_time)
{
	static char buf[9];

	buf[2]= ':';
	buf[5]= ':';

	number_to_string(rtc_time->hours,buf);
	number_to_string(rtc_time->minutes,&buf[3]);
	number_to_string(rtc_time->seconds,&buf[6]);

	buf[8] = '\0';

	return buf;

}

//dd/mm/yy
char* date_to_string(RTC_date_t *rtc_date)
{
	static char buf[9];

	buf[2]= '/';
	buf[5]= '/';

	number_to_string(rtc_date->date,buf);
	number_to_string(rtc_date->month,&buf[3]);
	number_to_string(rtc_date->year,&buf[6]);

	buf[8]= '\0';

	return buf;

}

void init_systick_timer(uint32_t tick_hz)
{
	uint32_t *pSRVR = (uint32_t*)0xE000E014;
	uint32_t *pSCSR = (uint32_t*)0xE000E010;

    /* calculation of reload value */
    uint32_t count_value = (SYSTICK_TIM_CLK/tick_hz)-1;

    //Clear the value of SVR
    *pSRVR &= ~(0x00FFFFFFFF);

    //load the value in to SVR
    *pSRVR |= count_value;

    //do some settings
    *pSCSR |= ( 1 << 1); //Enables SysTick exception request:
    *pSCSR |= ( 1 << 2);  //Indicates the clock source, processor clock source

    //enable the systick
    *pSCSR |= ( 1 << 0); //enables the counter

}

void SysTick_Handler(void)
{
	RTC_time_t current_time;
	RTC_date_t current_date;

	ds1307_get_current_time(&current_time);

	char *am_pm;
	if(current_time.time_format != TIME_FORMAT_24HRS)
	{
		am_pm = (current_time.time_format) ? "PM" : "AM";
#ifndef PRINT_LCD
		printf("Current time = %s %s\n",time_to_string(&current_time),am_pm); // 04:25:41 PM
#else
		lcd_set_cursor(1, 1);
		lcd_print_string(time_to_string(&current_time));
		lcd_print_string(am_pm);
#endif

	}else{
#ifndef PRINT_LCD
		printf("Current time = %s\n",time_to_string(&current_time)); // 04:25:41
#else
		lcd_set_cursor(1, 1);
		lcd_print_string(time_to_string(&current_time));
#endif
	}

	ds1307_get_current_date(&current_date);

#ifndef PRINT_LCD
	printf("Current date = %s <%s>\n",date_to_string(&current_date), get_day_of_week(current_date.day));
#else
	lcd_set_cursor(2, 1);
	lcd_print_string(date_to_string(&current_date));
	lcd_print_char('<');
	lcd_print_string(get_day_of_week(current_date.day));
	lcd_print_char('>');
#endif


}

static void mdelay(uint32_t cnt)
{
	for(uint32_t i=0 ; i < (cnt * 1000); i++);
}
